{"keras_version": "2.1.6", "config": [{"config": {"activation": "relu", "trainable": true, "bias_constraint": null, "padding": "valid", "dtype": "float32", "name": "conv2d_1", "filters": 36, "strides": [1, 1], "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "kernel_size": [3, 3], "batch_input_shape": [null, 30, 30, 3], "activity_regularizer": null, "bias_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "data_format": "channels_last"}, "class_name": "Conv2D"}, {"config": {"trainable": true, "padding": "valid", "strides": [2, 2], "data_format": "channels_last", "pool_size": [2, 2], "name": "max_pooling2d_1"}, "class_name": "MaxPooling2D"}, {"config": {"activation": "relu", "trainable": true, "filters": 72, "padding": "valid", "bias_constraint": null, "name": "conv2d_2", "strides": [2, 2], "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "kernel_size": [3, 3], "data_format": "channels_last", "activity_regularizer": null, "bias_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true}, "class_name": "Conv2D"}, {"config": {"trainable": true, "padding": "valid", "strides": [2, 2], "data_format": "channels_last", "pool_size": [2, 2], "name": "max_pooling2d_2"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "flatten_1", "data_format": "channels_last"}, "class_name": "Flatten"}, {"config": {"activation": "relu", "trainable": true, "bias_constraint": null, "name": "dense_1", "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 256, "kernel_regularizer": null, "use_bias": true}, "class_name": "Dense"}, {"config": {"seed": null, "trainable": true, "rate": 0.1, "name": "dropout_1", "noise_shape": null}, "class_name": "Dropout"}, {"config": {"activation": "softmax", "trainable": true, "bias_constraint": null, "name": "dense_2", "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 14, "kernel_regularizer": null, "use_bias": true}, "class_name": "Dense"}], "class_name": "Sequential", "backend": "tensorflow"}